РП/src/Enums/ВидыЭлементовФинансовогоОтчета/ВидыЭлементовФинансовогоОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭлементовФинансовогоОтчета</name>
  <enumValues>
    <name>ЗаголовокОтчета</name>
  </enumValues>
  <enumValues>
    <name>НередактируемыйТекст</name>
  </enumValues>
  <enumValues>
    <name>РедактируемыйТекст</name>
  </enumValues>
  <enumValues>
    <name>МонетарныйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>НемонетарныйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>СтатьяБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ВсеСтатьиБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ПоказательБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ВсеПоказателиБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ПроизводныйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>НефинансовыйПоказатель</name>
  </enumValues>
  <enumValues>
    <name>РедактируемоеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ТаблицаПоказателиВСтроках</name>
  </enumValues>
  <enumValues>
    <name>ТаблицаПоказателиВКолонках</name>
  </enumValues>
  <enumValues>
    <name>ТаблицаСложная</name>
  </enumValues>
  <enumValues>
    <name>ЭлементТаблицы</name>
  </enumValues>
  <enumValues>
    <name>Колонки</name>
  </enumValues>
  <enumValues>
    <name>Строки</name>
  </enumValues>
  <enumValues>
    <name>НастройкаЯчеек</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаТаблицы</name>
  </enumValues>
  <enumValues>
    <name>Измерение</name>
  </enumValues>
  <enumValues>
    <name>Группа</name>
  </enumValues>
  <enumValues>
    <name>ИтогПоГруппе</name>
  </enumValues>
  <enumValues>
    <name>ФормулаПоГруппе</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/ЭлементыФинансовыхОтчетов/ЭлементыФинансовыхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыФинансовыхОтчетов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ВидыБюджетов</owners>
  <owners>Catalog.ВидыФинансовыхОтчетов</owners>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовФинансовогоОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <comment>Наименование для печати, представление</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбратныйЗнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйЭлемент</name>
    <type>
      <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыВидаЭлемента</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперандыФормулы</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операнд</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыТаблицы</name>
    <attributes>
      <name>Строка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Колонка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоля</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьЗаголовок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВОтдельнойКолонке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыОформления</name>
    <attributes>
      <name>Оформление</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОформляемойОбласти</name>
      <type>
        <types>EnumRef.ТипыОформляемыхОбластейБюджетныхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеСтроки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеКолонки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаПолейОтбораЭО</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоляОтбора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРесурса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсточникиЗначений</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавляемыеЗначенияДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/CommonModules/МеждународнаяОтчетностьВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
//  Процедуры и функции, обеспечивающие работу генератора финансовых отчетов
//  для получения финансовой отчетности
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция возвращает валюты учета международного учета
//
Функция УчетнаяВалюта() Экспорт
	
	Возврат Новый Структура("Функциональная, Представления",
							Константы.ВалютаФункциональная.Получить(),
							Константы.ВалютаПредставления.Получить());
	
КонецФункции

#Область РаботаСФормулами

// Функция добавляет сохраненные операнды в таблицу операндов
//
// Параметры:
//  Форма  - УправляемаяФорма - Форма конструктора формул
//  НовыеОперанды  - Массив - Строки дерева операндов
//  ТаблицаОперандов - ТаблицаЗначений - Таблица выбранных в формуле операндов
//  Уникальный - Булево - признак уникальности операндов (добавлять операнды если есть)
//
// Возвращаемое значение:
//   Массив   - массив добавленных строк таблицы операндов
//
Функция ДобавитьСохраненныйОперанд(Операнд, ИдентификаторГлавногоХранилища) Экспорт
	
	ФинОтчеты = ФинансоваяОтчетностьВызовСервера;
	АдресСтруктурыЭлемента = МеждународнаяОтчетностьКлиентСервер.ПоместитьКопиюЭлементаВХранилище(
								Операнд.СвязанныйЭлемент,
								ИдентификаторГлавногоХранилища);
	ДанныеОперанда = ПолучитьИзВременногоХранилища(АдресСтруктурыЭлемента);
	НовыеОперанды = Новый Массив;
	Если ДанныеОперанда.ВидЭлемента = ВидЭлемента("МонетарныйПоказатель") Тогда
		
		НовыйОперанд = ДобавитьОперанд(Операнд, АдресСтруктурыЭлемента);
		НовыйОперанд.СчетПоказательИзмерение = Операнд.СчетПланаСчетов;
		НовыйОперанд.Код = ФинОтчеты.ЗначениеРеквизитаОбъекта(НовыйОперанд.СчетПоказательИзмерение,"Порядок");
		НовыеОперанды.Добавить(НовыйОперанд);
		
	ИначеЕсли ДанныеОперанда.ВидЭлемента = ВидЭлемента("НемонетарныйПоказатель") Тогда
		
		НовыйОперанд = ДобавитьОперанд(Операнд, АдресСтруктурыЭлемента);
		НовыйОперанд.СчетПоказательИзмерение = Операнд.НемонетарныйПоказатель;
		НовыйОперанд.Код = ФинОтчеты.ЗначениеРеквизитаОбъекта(НовыйОперанд.СчетПоказательИзмерение,"Код");
		НовыеОперанды.Добавить(НовыйОперанд);
		
	ИначеЕсли ДанныеОперанда.ВидЭлемента = ВидЭлемента("ПроизводныйПоказатель") Тогда
		Формула = ФинОтчеты.ЗначениеДополнительногоРеквизита(ДанныеОперанда,"Формула");
		Для Каждого ОперандФормулы Из ДанныеОперанда.ОперандыФормулы Цикл
			
			АдресОперанда = ОперандФормулы.АдресСтруктурыЭлемента;
			Данные = ПолучитьИзВременногоХранилища(АдресОперанда);
			НовыйОперанд = ДобавитьОперанд(Данные, АдресОперанда);
			НовыйОперанд.Идентификатор = ОперандФормулы.Идентификатор;
			Если Данные.ВидЭлемента = ВидЭлемента("МонетарныйПоказатель") Тогда
				НовыйОперанд.СчетПоказательИзмерение = ФинОтчеты.ЗначениеДополнительногоРеквизита(Данные,"СчетПланаСчетов");
				НовыйОперанд.СчетПланаСчетов = НовыйОперанд.СчетПоказательИзмерение;
				НовыйОперанд.ТипИтога = ФинОтчеты.ЗначениеДополнительногоРеквизита(Данные,"ТипИтога");
				НовыйОперанд.НачальноеСальдо = ФинОтчеты.ЗначениеДополнительногоРеквизита(Данные,"НачальноеСальдо");
			ИначеЕсли Данные.ВидЭлемента = ВидЭлемента("НемонетарныйПоказатель") Тогда
				НовыйОперанд.СчетПоказательИзмерение = ФинОтчеты.ЗначениеДополнительногоРеквизита(Данные,"НемонетарныйПоказатель");
			КонецЕсли;
			
			НовыеОперанды.Добавить(НовыйОперанд);
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат Новый Структура("Формула,НовыеОперанды",Формула,НовыеОперанды);
	
КонецФункции

Процедура ПроверитьФормулу(Формула, Операнды, Отказ, Поле = "", ПутьКДанным = "") Экспорт
	
	ФинОтчеты = ФинансоваяОтчетностьСервер;
	ЗначенияОперандов = ПустаяТаблицаЭлементаПоказателя();
	
	Если ПустаяСтрока(Формула) Тогда
		ТекстУведомления = НСтр("ru='Не указан текст формулы.';uk='Не вказаний текст формули.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстУведомления, , Поле, ПутьКДанным,);
	КонецЕсли;
	
	ПериодВыборки = МеждународнаяОтчетностьСервер.ПериодОтчета(Дата('00010101'), Дата('00010101'));
	ИнтервалыОтчета = Справочники.ЭлементыФинансовыхОтчетов.ИнтервалыОтчета(ПериодВыборки);
	
	СхемаКД = Справочники.ЭлементыФинансовыхОтчетов.ПолучитьМакет("ПроизводныйПоказатель");
	ТипЧисло = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 2));
	ПсТаб = Символы.ПС + Символы.Таб;
	НеИспользуемыеОперанды = "";
	Монетарный = Перечисления.ВидыЭлементовФинансовогоОтчета.МонетарныйПоказатель;
	Для Каждого Операнд Из Операнды Цикл
		НовоеПолеНабора = ФинОтчеты.НовоеПолеНабора(СхемаКД.НаборыДанных.ЗначенияОперандов, Операнд.Идентификатор,,,ТипЧисло);
		ЗначенияОперандов.Колонки.Добавить(Операнд.Идентификатор, Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 2)));
		Идентификатор = "["+Операнд.Идентификатор+"]";
		Если СтрНайти(Формула, Идентификатор) = 0 Тогда
			НеИспользуемыеОперанды = НеИспользуемыеОперанды + Идентификатор + " " + Операнд.НаименованиеДляПечати + ПсТаб;
		КонецЕсли;
		Если Операнд.ВидЭлемента = Монетарный И НЕ ЗначениеЗаполнено(Операнд.СчетПланаСЧетов) Тогда
			Шаблон = НСтр("ru='В настройках операнда [%1] %2
                                |не указан счет плана счетов.'
                                |;uk='У настройках операнда [%1] %2
                                |не зазначений рахунок плану рахунків.'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Операнд.Идентификатор, Операнд.НаименованиеДляПечати);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , Поле, ПутьКДанным,);
		КонецЕсли;
	КонецЦикла;
	Если НЕ ПустаяСтрока(НеИспользуемыеОперанды) Тогда
		ТекстУведомления = НСтр("ru='Найдены не используемые операнды:';uk='Знайдені не використовувані операнди:'") + ПсТаб + НеИспользуемыеОперанды;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстУведомления, , Поле, ПутьКДанным,);
	КонецЕсли;
	ПолеЗначения = СхемаКД.ВычисляемыеПоля[0];
	ПолеЗначения.Выражение = ?(ЗначениеЗаполнено(Формула),Формула,"0");
	Компоновщик = ФинОтчеты.КомпоновщикСхемы(СхемаКД);
	Настройки = Компоновщик.ПолучитьНастройки();
	ВнешниеНаборы = Новый Структура;
	ВнешниеНаборы.Вставить("ЗначенияОперандов", ЗначенияОперандов);
	ВнешниеНаборы.Вставить("ИнтервалыОтчета", ИнтервалыОтчета);
	
	Попытка
		ДанныеПоказателя = ФинОтчеты.ВыгрузитьРезультатСКД(СхемаКД, Настройки, ВнешниеНаборы);
	Исключение
		Инфо = ИнформацияОбОшибке();
		ТекстОписанияОшибки = Инфо.Причина.Причина.Описание;
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстОписанияОшибки,
					,
					Поле,
					ПутьКДанным,);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбработкиЭлементовОтчета

Функция ЕстьСсылки(ЭлементОтчета, КоличествоСсылко = 0) Экспорт

	ЕстьСсылки = Ложь;
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = ФинансоваяОтчетностьСервер.ТаблицаИндексовКартинок();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = МеждународнаяОтчетностьСервер.ТекстЗапросаСсылокНаЭлементОтчета();
	Запрос.УстановитьПараметр("ЭлементОтчета", ЭлементОтчета);
	Запрос.УстановитьПараметр("Владелец", ЭлементОтчета.Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоСсылко = Выборка.Количество();
	Если Выборка.Следующий() Тогда
		ЕстьСсылки = Истина;
	КонецЕсли;
	Возврат ЕстьСсылки;

КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииРасшифровкиОтчета

Функция ПараметрыРасшифровкиОтчета(Расшифровка, ПараметрыОтчета) Экспорт
	
	ПараметрыРасшифровки = НовыеПараметрыРасшифровкиОтчета();
	ЗаполнитьЗначенияСвойств(ПараметрыРасшифровки, ПараметрыОтчета);
	ЗаполнитьЗначенияСвойств(ПараметрыРасшифровки.Отбор, ПараметрыОтчета);
	
	Если ТипЗнч(Расшифровка) <> Тип("Структура") Тогда
		Возврат ПараметрыРасшифровки;
	КонецЕсли;
	Если Расшифровка.Свойство("Отбор") Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыРасшифровки.Отбор, Расшифровка.Отбор);
	КонецЕсли;
	
	ПараметрыРасшифровки.Показатель = Расшифровка.Показатель;
	Если Расшифровка.Свойство("Субконто1") Тогда
		ПараметрыРасшифровки.Отбор.Вставить("Субконто1", Расшифровка.Субконто1);
		ПараметрыРасшифровки.ВидСубконто = Расшифровка.ВидСубконто;
	КонецЕсли;
	
	Если ПараметрыРасшифровки.Показатель = Неопределено Тогда
		Возврат ПараметрыРасшифровки;
	КонецЕсли;
	
	ПериодОтчета = Новый СтандартныйПериод;
	ПериодОтчета.ДатаНачала = Расшифровка.ДатаНачала;
	ПериодОтчета.ДатаОкончания = Расшифровка.ДатаОкончания;
	ПараметрыРасшифровки.Вставить("ПериодОтчета", ПериодОтчета);
	
	РеквизитыПоказателя = РеквизитыПоказателя(ПараметрыРасшифровки.Показатель);
	РеквизитыПоказателя.Вставить("Значение", ПараметрыОтчета.Значение);
	Если ПараметрыРасшифровки.Отбор.Свойство("Субконто1") Тогда
		РеквизитыПоказателя.Вставить("Субконто1", ПараметрыРасшифровки.Отбор.Субконто1);
		РеквизитыПоказателя.Вставить("ВидСубконто", ПараметрыРасшифровки.ВидСубконто);
	КонецЕсли;
	ПараметрыРасшифровки.Показатель = РеквизитыПоказателя;
	ПараметрыРасшифровки.Вставить("ПустаяСсылка", Справочники.ЭлементыФинансовыхОтчетов.ПустаяСсылка());
	
	// Подготовим настройки отчетов расшифровки
	Если ТипЗнч(РеквизитыПоказателя.СчетПланаСчетов) = Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		ПараметрыРасшифровки.Отбор.Вставить("Счет", ПараметрыРасшифровки.Показатель.СчетПланаСчетов);
		НастройкаАнализаСчета = НастроитьАнализСчетаХозрасчетный(ПараметрыОтчета.АдресНастроек, ПараметрыРасшифровки);
		
	ИначеЕсли ТипЗнч(РеквизитыПоказателя.СчетПланаСчетов) = Тип("ПланСчетовСсылка.Международный") Тогда
		НастройкаАнализаСчета = НастроитьАнализСчетаМеждународный(ПараметрыРасшифровки);
		
	КонецЕсли;
	
	ПараметрыРасшифровки.Вставить("НастройкаАнализаСчета", НастройкаАнализаСчета);
	
	Возврат ПараметрыРасшифровки;
	
КонецФункции

Функция НастроитьАнализСчетаХозрасчетный(Адрес, Параметры) Экспорт
	
	// Настройки отчета расшифровки
	НастройкаОтчета = Новый Структура("АдресНастроек", Адрес);
	
	ДанныеРасшифровки = Новый Структура("НастройкиРасшифровки",Новый Структура("АнализСчета"));
	ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	ПользовательскийОтбор = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
	ПользовательскийОтбор.ИдентификаторПользовательскойНастройки = "Отбор";
	
	// Передадим отбор монетарного показателя
	НастройкиОтбора = Параметры.Показатель.ДополнительныйОтбор.Получить();
	Если НастройкиОтбора <> Неопределено Тогда
		ФинансоваяОтчетностьСервер.СкопироватьОтбор(
				НастройкиОтбора.Отбор,
				ПользовательскийОтбор,
				Истина);
	КонецЕсли;
	
	// Передадим реквизиты отчета
	РеквизитыОтчета = ПользовательскиеНастройки.ДополнительныеСвойства;
	РеквизитыОтчета.Вставить("ПоказательБУ", Истина);
	РеквизитыОтчета.Вставить("РежимРасшифровки", Истина);
	РеквизитыОтчета.Вставить("НачалоПериода", Параметры.ПериодОтчета.ДатаНачала);
	РеквизитыОтчета.Вставить("КонецПериода", Параметры.ПериодОтчета.ДатаОкончания);
	
	Для Каждого Параметр Из Параметры.Отбор Цикл
		Если ЗначениеЗаполнено(Параметр.Значение) Тогда
			РеквизитыОтчета.Вставить(Параметр.Ключ, Параметр.Значение);
			Если (Параметр.Ключ = "Организация" ИЛИ Параметр.Ключ = "Подразделение")
				И ТипЗнч(Параметр.Значение) = Тип("Массив") Тогда
				РеквизитыОтчета.Вставить(Параметр.Ключ, Параметр.Значение[0]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеРасшифровки.НастройкиРасшифровки.АнализСчета = ПользовательскиеНастройки;
	ПоместитьВоВременноеХранилище(ДанныеРасшифровки,Адрес);
	
	Возврат НастройкаОтчета;
	
КонецФункции

Функция НастроитьАнализСчетаМеждународный(Знач Параметры) Экспорт
	
	// Настройки отчета расшифровки
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	ИмяСхемы = Метаданные.Отчеты.БухгалтерскийОтчетМеждународный.ОсновнаяСхемаКомпоновкиДанных.Имя;
	СхемаРасшифровки = Отчеты.БухгалтерскийОтчетМеждународный.ПолучитьМакет(ИмяСхемы);
	НастройкиВарианта = СхемаРасшифровки.ВариантыНастроек.АнализСчетаМеждународный.Настройки;
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВарианта);
	ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
	ПользовательскийОтбор = КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
	Для Каждого Элемент Из ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ОтборКомпоновкиДанных") Тогда
			ПользовательскийОтбор = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Установим параметры отчета расшифровки
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(ПользовательскиеНастройки, "ПериодОтчета", Параметры.ПериодОтчета);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(ПользовательскиеНастройки, "ПредставлениеСчетовПоКоду", Истина);
	ЭтоФункциональнаяВалюта = Параметры.Ресурс = "Сумма";
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(ПользовательскиеНастройки, "ПоказательСумма", ЭтоФункциональнаяВалюта);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(ПользовательскиеНастройки, "ПоказательСуммаПредставления", НЕ ЭтоФункциональнаяВалюта);
	Если Параметры.Отбор.Свойство("Субконто1") Тогда
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(ПользовательскиеНастройки, "ВидСубконто", Параметры.ВидСубконто);
	КонецЕсли;
	
	// Установим отборы на точное соответствие
	ФинОтчеты = ФинансоваяОтчетностьСервер;
	Для Каждого Отбор Из Параметры.Отбор Цикл
		Если ЗначениеЗаполнено(Отбор.Значение) Тогда
			ЗначениеОтбора = Отбор.Значение;
			Если ТипЗнч(ЗначениеОтбора) = Тип("Массив") Тогда
				ЗначениеОтбора = Новый СписокЗначений;
				ЗначениеОтбора.ЗагрузитьЗначения(Отбор.Значение);
			КонецЕсли;
			ФинОтчеты.НовыйОтбор(ПользовательскийОтбор,Отбор.Ключ,ЗначениеОтбора);
		КонецЕсли;
	КонецЦикла;
	
	// Установим отбор по монетарному показателю
	Если Параметры.Свойство("Показатель") Тогда
		ОтборСчета = ФинОтчеты.НовыйОтбор(ПользовательскийОтбор,"Счет",Параметры.Показатель.СчетПланаСчетов);
		ОтборСчета.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		НастройкиОтбора = Параметры.Показатель.ДополнительныйОтбор.Получить();
		Если НастройкиОтбора <> Неопределено Тогда
			ФинОтчеты.СкопироватьОтбор(
					НастройкиОтбора.Отбор,
					ПользовательскийОтбор,
					Истина);
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("Счет") Тогда
		ОтборСчета = ФинОтчеты.НовыйОтбор(ПользовательскийОтбор,"Счет",Параметры.Счет);
		ОтборСчета.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
	КонецЕсли;
	
	Возврат КомпоновщикНастроек;
	
КонецФункции

Функция РеквизитыПоказателя(Знач Показатель)
	
	ДанныеЭлемента = ФинансоваяОтчетностьКлиентСервер.СтруктураЭлементаОтчета();
	Реквизиты = "СчетПланаСчетов,НемонетарныйПоказатель,Формула";
	Если ЗначениеЗаполнено(Показатель.СвязанныйЭлемент) Тогда
		Показатель = Показатель.СвязанныйЭлемент;
	КонецЕсли;
	
	ТаблицыЭлемента = "РеквизитыВидаЭлемента,ИсточникиЗначений,ОперандыФормулы,ЭлементыТаблицы,ДополнительныеПоля,ЭлементыОформления,ОформляемыеСтроки,ОформляемыеКолонки,РасшифровкаПолейОтбораЭО";
	
	ДопРеквизиты = ФинансоваяОтчетностьВызовСервера.ЗначенияДополнительныхРеквизитов(Показатель, Реквизиты);
	ЗаполнитьЗначенияСвойств(ДанныеЭлемента, Показатель,,ТаблицыЭлемента);
	Для Каждого Реквизит Из ДопРеквизиты Цикл
		ДанныеЭлемента.Вставить(Реквизит.Ключ, Реквизит.Значение);
	КонецЦикла;
	
	Возврат ДанныеЭлемента;
	
КонецФункции

Функция НовыеПараметрыРасшифровкиОтчета()
	
	Результат = Новый Структура;
	Результат.Вставить("ВидОтчета");
	Результат.Вставить("КомплектОтчетности");
	Результат.Вставить("Показатель");
	Результат.Вставить("Ресурс");
	Результат.Вставить("Значение");
	Результат.Вставить("ВидСубконто");
	Результат.Вставить("СуммыВТысячах");
	
	Отбор = Новый Структура("Организация,Подразделение");
	Результат.Вставить("Отбор", Отбор);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПустаяТаблицаЭлементаПоказателя()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Показатель",    Новый ОписаниеТипов("СправочникСсылка.ЭлементыФинансовыхОтчетов"));
	Результат.Колонки.Добавить("Примечание",    Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
	Результат.Колонки.Добавить("КодСтроки",     Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(20)));
	Результат.Колонки.Добавить("ДатаНачала",    Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	Результат.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	Результат.Колонки.Добавить("Значение",      Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 2)));
	Возврат Результат;
	
КонецФункции

Функция ВидЭлемента(ИмяВидаЭлемента)
	
	Возврат Перечисления.ВидыЭлементовФинансовогоОтчета[ИмяВидаЭлемента];
	
КонецФункции

Функция ДобавитьОперанд(ДанныеОперанда, АдресСтруктурыЭлемента)
	
	НовыйОперанд = МеждународнаяОтчетностьКлиентСервер.НовыеДанныеОперанда();
	ЗаполнитьЗначенияСвойств(НовыйОперанд, ДанныеОперанда,,"СвязанныйЭлемент");
	НовыйОперанд.АдресСтруктурыЭлемента = АдресСтруктурыЭлемента;
	НовыйОперанд.ЭтоСвязанный = Ложь;
	НовыйОперанд.НестандартнаяКартинка = ФинансоваяОтчетностьПовтИсп.НестандартнаяКартинка(ДанныеОперанда.ВидЭлемента);
	
	Возврат НовыйОперанд;
	
КонецФункции

#КонецОбласти
